Repository: uyuni-project/uyuni-tools
Catalog: locale/mgrpxy/*.po
Languages: ca, fr, ja

source: Clear the cache
ca: Neteja la memòria cau
ja: キャッシュのクリア

source: failed retrieving namespace
ca: no s'ha pogut recuperar l'espai de noms
ja: ネームスペースの取得に失敗しました

source: failed to remove cached data
ca: no s'han pogut eliminar les dades de la memòria cau
ja: キャッシュされたデータを削除できませんでした

source: Manage proxy cache
ca: Gestiona la memòria cau del servidor intermediari
ja: プロキシキャッシュの管理

source: Uyuni proxy administration tool
ca: Eina d'administració del servidor intermediari d'Uyuni
fr: Outil d'administration de proxy Uyuni
ja: Uyuniプロキシ管理ツール

source: Tool to help administering Uyuni proxies in containers
ca: Eina per a ajudar a administrar els servidors intermediaris Uyuni en contenidors
fr: Outil pour aider à administrer des proxy Uyuni dans des conteneurs
ja: Uyuniプロキシのコンテナ管理を支援するツール

source: Server Deployment:
ca: Desplegament del servidor:
ja: サーバ配備:

source: Server Management:
ca: Gestió del servidor:
ja: サーバ管理:

source: Administrator tools:
ca: Eines de l'administrador:
ja: 管理者ツール:

source: Starting %s
ca: S'inicia %s

source: Use of this software implies acceptance of the End User License Agreement.
ca: L'ús d'aquest programari implica l'acceptació de l'Acord de llicència d'usuari final.
ja: このソフトウェアを使用すると、エンドユーザライセンス契約に同意したことになります。

source: configuration file path
ca: camí del fitxer de configuració
fr: chemin vers le fichier de configuration
ja: 設定ファイルパス

source: Install a new proxy from scratch
ca: Instal·la un servidor intermediari nou des de zero
fr: Installer un nouveau proxy
ja: 最初から新しいプロキシをインストールする

source: Install a new proxy on a running kubernetes cluster
ca: Instal·la un servidor intermediari nou en un clúster de kubernetes en execució
fr: Installer un nouveau proxy sur un cluster kubernetes existant
ja: 実行中のkubernetesクラスタに新しいプロキシをインストールする

source: Install a new proxy on a running kubernetes cluster. It only takes the path to the configuration tarball generated by the server as parameter. The install kubernetes command assumes kubectl is installed locally. NOTE: for now installing on a remote kubernetes cluster is not supported!
ca: Instal·la un servidor intermediari nou en un clúster de kubernetes en execució. Només pren el camí a la configuració tarball generada pel servidor com a paràmetre. L'ordre install kubernetes assumeix que el kubectl està instal·lat localment. NOTA: per ara no s'admet la instal·lació en un clúster de kubernetes remot!
fr: Installer un nouveau proxy sur un cluster kubernetes existant. Ne prend que le chemin vers l'archive de configuration générée par le serveur comme paramètre. La command install kubernetes suppose que kubectl est installé en local. NOTE: pour l'instant l'installation sur un cluster kubernetes distant n'est pas supportée!
ja: 実行中のkubernetesクラスタに新しいプロキシをインストールします。 サーバが生成した設定tarballへのパスのみをパラメータとして受け取ります。 install kubernetesコマンドは、kubectlがローカルにインストールされていることを前提としています。 メモ: 現時点では、リモートkubernetesクラスタへのインストールはサポートされていません。

source: install %s before running this command
ca: instal·la %s abans d'executar aquesta ordre
fr: installer %s avant d'exécuter cette commande
ja: このコマンドを実行する前に %s をインストールする

source: failed to extract configuration
ca: no s'ha pogut extreure la configuració
fr: impossible d'extraire la configuration
ja: 設定の抽出に失敗しました

source: cannot deploy proxy helm chart
ca: no s'ha pogut desplegar el diagrama de timons del servidor intermediari
ja: プロキシhelmチャートを配備できません

source: Install a new proxy on podman
ca: Instal·la un servidor intermediari nou a podman
fr: Installer un nouveau proxy sur podman
ja: podmanに新しいプロキシをインストールする

source: install podman before running this command
ca: instal·la podman abans d'executar aquesta ordre
fr: installer podman avant d'exécuter cette commande
ja: このコマンドを実行する前にpodmanをインストールする

source: failed to retrieve proxy config files
ca: no s'han pogut recuperar els fitxers de configuració del servidor intermediari
ja: プロキシ設定ファイルの取得に失敗しました

source: Unable to fetch up to date systemid, using one from the provided configuration file
ca: No s'ha pogut obtenir l'ID del sistema actualitzat, se n'usa un del fitxer de configuració proporcionat.

source: failed to find proxy pod
ca: no s'ha pogut trobar el servidor pod
ja: プロキシポッドが見つかりませんでした

source: failed to find proxy deployment namespace
ca: no s'ha pogut trobar l'espai de noms de desplegament del servidor intermediari
ja: プロキシ配備ネームスペースが見つかりませんでした

source: Get the proxy logs
ca: Obtenir els registres del servidor intermediari
ja: プロキシログの取得

source: Get the proxy logs The command automatically detects installed backend and displays the logs for containers managed by Kubernetes or Podman However, you can specify the pod and/or container names to get the logs for specific container(s). See examples for more details.
ca: Obtenir els registres del servidor intermediari L'ordre detecta automàticament el dorsal instal·lat i mostra els registres dels contenidors gestionats per Kubernetes o Podman No obstant això, podeu especificar els noms de pod i/o contenidor per a obtenir els registres per a contenidors específics. Vegeu exemples per a més detalls.
ja: プロキシログの取得 このコマンドは、インストールされたバックエンドを自動的に検出し、KubernetesまたはPodmanが管理しているコンテナのログを表示します ただし、ポッド名および/またはコンテナ名を指定して、特定のコンテナのログを取得できます。 詳細については、例を参照してください。

source: specify if logs should be followed
ca: especifica si s'han de seguir els registres
ja: ログの追跡を行うかどうかを指定します

source: show timestamps in the log outputs
ca: mostra les marques horàries a les sortides del registre
ja: ログ出力にタイムスタンプを表示します

source: number of lines to show from the end of the logs
ca: nombre de línies a mostrar des del final dels registres
ja: ログの末尾から表示する行数

source: show logs since a specific time or duration. Supports Go duration strings and RFC3339 format (e.g. 3h, 2023-01-02T15:04:05)
ca: mostra els registres des d'un temps o durada específics. Permet cadenes de durada Go i format RFC3339 (p. ex. 3h, 2023-01-02T15:04:05)
ja: 特定の時刻または期間以降のログを表示します。 Go期間文字列およびRFC3339形式をサポートしています(3h、2023-01-02T15:04:05など)

source: Restart the proxy
ca: Reinicia el servidor intermediari
fr: Redémarrer le proxy
ja: プロキシの再起動

source: Start the proxy
ca: Inicia el servidor intermediari
fr: Démarrer le proxy
ja: プロキシの起動

source: failed to get deployment status
ca: no s'ha pogut obtenir l'estat de desplegament
ja: 配備ステータスの取得に失敗しました

source: Some replicas are not ready: %[1]d / %[2]d
ca: Algunes rèpliques no estan preparades: %[1]d / %[2]d
ja: いくつかのレプリカは準備ができていません: %[1]d / %[2]d

source: the pod is not running
ca: el pod no s'està executant
fr: le pod n'est pas exécuté
ja: ポッドが実行されていません

source: Proxy containers up and running
ca: Contenidors del servidor intermediari en funcionament
fr: Les conteneurs du proxy sont démarrés
ja: プロキシコンテナが稼働中です

source: Failed to get status of the %s service
ca: No s'ha pogut obtenir l'estat del servei %s
fr: Impossible d'obtenir l'état du service %s
ja: %s サービスのステータスを取得できませんでした

source: failed to get the status of at least one service
ca: no s'ha pogut obtenir l'estat d'almenys un servei
fr: impossible d'obtenir l'état d'au moins un des services
ja: 少なくとも1つのサービスのステータスを取得できませんでした

source: Get the proxy status
ca: Obtenir l'estat del servidor intermediari
fr: Obtenir le status du proxy
ja: プロキシステータスの取得

source: no installed proxy detected
ca: no s'ha detectat cap servidor intermediari instal·lat
fr: aucun proxy installé détecté
ja: インストールされているプロキシが検出されませんでした

source: Stop the proxy
ca: Atura el servidor intermediari
fr: Arrêter le proxy
ja: プロキシの停止

source: Extract configuration and logs
ca: Extreu configuració i registres
ja: 設定とログの抽出

source: Extract the host or cluster configuration and logs as well as those from the containers for support to help debugging.
ca: Extreu la configuració del servidor o del clúster i els registres, així com els de els contenidors de suport per ajudar a la depuració.
ja: デバッグを支援するため、ホストまたはクラスタの設定とログ、および コンテナから設定とログを抽出します。

source: path where to extract the data
ca: camí on extreure les dades
ja: データを抽出するパス

source: Install a PTF or Test package on a kubernetes cluster
ca: Instal·la un paquet PTF o Test en un clúster de kubernetes
ja: PTFまたはTestパッケージをkubernetesクラスタにインストールする

source: Install a PTR of Test package on a kubernetes cluster The support ptf command assumes the following: * kubectl and helm are installed locally * a working kubectl configuration should be set to connect to the cluster to deploy to The helm values file will be overridden with the values from the command parameters or configuration. NOTE: installing on a remote cluster is not supported yet!
ca: Instal·la un paquet PTR de Test en un clúster de kubernetes L'ordre ptf de suport assumeix el següent: * El kubectl i el helm s'instal·len localment * s'ha d'establir una configuració de kubectl que funcioni per a connectar-se al clúster on desplegar El fitxer de valors del helm se sobreescriurà amb els valors dels paràmetres de l'ordre o de la configuració. NOTA: la instal·lació en un clúster remot encara no està suportada!
ja: kubernetesクラスタにTestパッケージのPTRをインストールする support ptfコマンドは次のことを前提としています。 * kubectlとhelmがローカルにインストールされている *配備先のクラスタに接続するために、動作するkubectl構成が設定されている helm値ファイルは、コマンドのパラメータまたは設定の値で上書きされます。 メモ:リモートクラスタへのインストールはまだサポートされていません。

source: Install a PTF or Test package on podman
ca: Instal·la un paquet PTF o Test a podman
ja: PTFまたはTestパッケージをpodmanにインストールする

source: Install a PTF or Test package on podman The support ptf podman command assumes podman is installed locally and the host machine is registered to SCC. NOTE: for now installing on a remote podman is not supported!
ca: Instal·la un paquet PTF o Test a podman L'ordre de suport ptf podman assumeix que podman està instal·lat localment i la màquina amfitrió està registrada a SCC. NOTA: per ara no s'admet la instal·lació en un podman remot!
ja: PTFまたはTestパッケージをpodmanにインストールする support ptf podmanコマンドは、podmanがローカルにインストールされ、 ホストマシンがSCCに登録されていることを前提としています。 メモ: 現時点では、リモートpodmanへのインストールはサポートされていません。

source: cannot find httpd image: it will no be upgraded
ca: no es pot trobar la imatge httpd: no s'actualitzarà
ja: httpdイメージが見つかりません: アップグレードされません

source: cannot find salt-broker image: it will no be upgraded
ca: no es pot trobar la imatge salt-broker: no es millorarà
ja: salt-brokerイメージが見つかりません: アップグレードされません

source: cannot find squid image: it will no be upgraded
ca: no s'ha pogut trobar la imatge del calamar: no s'actualitzarà
ja: squidイメージが見つかりません: アップグレードされません

source: cannot find ssh image: it will no be upgraded
ca: no es pot trobar la imatge ssh: no s'actualitzarà
ja: sshイメージが見つかりません: アップグレードされません

source: cannot find tftpd image: it will no be upgraded
ca: no es pot trobar la imatge tftpd: no s'actualitzarà
ja: tftpdイメージが見つかりません: アップグレードされません

source: ptf and test flags cannot be set simultaneously
ca: ptf i indicadors de prova no es poden establir simultàniament
ja: ptfとtestフラグを同時に設定することはできません

source: ptf and test flags cannot be empty simultaneously
ca: ptf i les banderes de prova no poden estar buides simultàniament
ja: ptfとtestフラグを同時に空にすることはできません

source: user flag cannot be empty
ca: l'indicador d'usuari no pot estar buit
ja: ユーザフラグは空にできません

source: The %[1]s ptf image computed is: %[2]s
ca: La imatge ptf de %[1]s calculada és %[2]s

source: Install a PTF
ca: Instal·la un PTF
ja: PTFのインストール

source: Commands for support operations
ca: Ordres per a operacions de suport
ja: サポート操作用のコマンド

source: --purge-volumes is ignored on a kubernetes deployment
ca: --purge-volumes s'ignora en un desplegament de kubernetes
ja: --purge-volumesは、kubernetes配備で無視されます

source: --purge-images is ignored on a kubernetes deployment
ca: --purge-images s'ignora en un desplegament de kubernetes
ja: --purge-imagesは、kubernetes配備で無視されます

source: Nothing has been uninstalled, run with --force to actually uninstall
ca: No s'ha desinstal·lat res, executeu amb --force per a desinstal·lar
ja: 何もアンインストールされていません。--forceを指定して実行することでアンインストールされるようにしてください

source: Volumes have not been touched. Depending on the storage class used, they may not have been removed
ca: No s'han tocat els volums. Depenent de la classe d'emmagatzematge utilitzada, és possible que no s'hagin eliminat
ja: ボリュームに何の操作も行われていません。使用したストレージクラスによっては、削除されていない可能性があります

source: cannot delete volume %s
ca: no es pot suprimir el volum %s
ja: ボリューム %s を削除できません

source: All volumes removed
ca: S'han eliminat tots els volums
fr: Tous les volumes ont été supprimés
ja: すべてのボリュームが削除されました

source: Failed to delete /etc/uyuni/proxy folder
ca: Ha fallat en suprimir la carpeta /etc/uyuni/proxy
ja: /etc/uyuni/proxyフォルダを削除できませんでした

source: /etc/uyuni/proxy folder removed
ca: s'ha eliminat la carpeta /etc/uyuni/proxy
ja: /etc/uyuni/proxyフォルダが削除されました

source: cannot delete image %s
ca: no es pot suprimir la imatge %s
ja: イメージ %s を削除できません

source: All images have been removed
ca: S'han eliminat totes les imatges
ja: すべてのイメージが削除されました

source: Nothing has been uninstalled, run with --force and --purge-volumes to actually uninstall and clear data
ca: No s'ha desinstal·lat res, executeu amb --force i --purge-volumes per a desinstal·lar i netejar dades
ja: 何もアンインストールされていません。--forceと--purge-volumesを指定して実行して、データがアンインストールされてクリアされるようにしてください

source: Data have been kept, use podman volume commands to clear the volumes
ca: S'han mantingut les dades, utilitzeu ordres de volum podman per netejar els volums
ja: データが保管されています。podmanボリュームコマンドを使用して、ボリュームをクリアしてください

source: Uninstall a proxy
ca: Desinstal·la un servidor intermediari
fr: Désinstaller un proxy
ja: プロキシのアンインストール

source: Uninstall a proxy and optionally the corresponding volumes. By default it will only print what would be done, use --force to actually remove.
ca: Desinstal·la un proxy i opcionalment els volums corresponents. Per defecte només imprimirà el que es faria, utilitzeu --force per eliminar-lo.
fr: Désinstaller un proxy et optionnellement les volumes associés. Par défaut les actions qui seraient effectuées sont seulement affichées, utiliser --force pour effectivement supprimer.
ja: プロキシ、およびオプションで対応するボリュームをアンインストールします。 デフォルトでは、実行される内容のみが出力され、実際に削除するには--forceを使用します。

source: Upgrade a proxy on a running kubernetes cluster
ca: Actualitza un servidor intermediari en un clúster de kubernetes en execució
ja: 実行中のkubernetesクラスタ上のプロキシをアップグレードする

source: Upgrade a proxy on a running kubernetes cluster. The upgrade kubernetes command assumes kubectl is installed locally. NOTE: for now upgrading on a remote kubernetes cluster is not supported!
ca: Actualitzeu un servidor intermediari en un clúster de kubernetes en execució. L'ordre upgrade kubernetes assumeix que el kubectl està instal·lat localment. NOTA: per ara no s'admet l'actualització en un clúster de kubernetes remot!
ja: 実行中のkubernetesクラスタ上のプロキシをアップグレードします。 upgrade kubernetesコマンドは、kubectlがローカルにインストールされていることを前提としています。 メモ: 現時点では、リモートkubernetesクラスタ上でのアップグレードはサポートされていません。

source: Upgrade a proxy on podman
ca: Actualitza un servidor intermediari a podman
ja: podmanでプロキシをアップグレードする

source: Upgrade a proxy
ca: Actualitza un servidor intermediari
ja: プロキシのアップグレード

source: Kubernetes namespace where to install the proxy
ca: Espai de noms del Kubernetes on instal·lar el servidor intermediari
fr: Namespace kubernetes dans lequel installer le proxy
ja: プロキシをインストールするKubernetesネームスペース

source: URL to the proxy helm chart
ca: URL al diagrama del timó del servidor intermediari
fr: URL du helm chart du proxy
ja: プロキシhelmチャートへのURL

source: Version of the proxy helm chart
ca: Versió del diagrama del timó del proxy
fr: Version du helm chart du proxy
ja: プロキシhelmチャートのバージョン

source: Path to a values YAML file to use for proxy helm install
ca: Camí a un fitxer YAML de valors que s'utilitzarà per a la instal·lació del timó intermediari
fr: Chemin vers un fichier YAML de valeurs à utiliser pour l'installation helm du proxy
ja: プロキシhelmインストールに使用する値YAMLファイルへのパス

source: Installing Uyuni proxy
ca: S'està instal·lant el servidor intermediari Uyuni
fr: Installer un proxy Uyuni
ja: Uyuniプロキシのインストール

source: cannot run helm upgrade
ca: no es pot executar l'actualització del helm
ja: helmアップグレードを実行できません

source: failed to write in file %s
ca: no s'ha pogut escriure al fitxer %s
ja: ファイル %s への書き込みに失敗しました

source: failed to scale replicas to 1
ca: no s'ha pogut escalar les rèpliques a 1
ja: レプリカを1にスケールできませんでした

source: cannot setup network
ca: no s'ha pogut configurar la xarxa
ja: ネットワークを設定できません

source: Generating systemd services
ca: S'estan generant els serveis de systemd
fr: Génération de services systemd
ja: systemdサービスの生成

source: failed to generate systemd file '%s'
ca: no s'ha pogut generar el fitxer de systemd «%s»
ja: systemdファイル「%s」の生成に失敗しました

source: cannot generate systemd conf file
ca: no s'ha pogut generar el fitxer conf del systemd
ja: systemd confファイルを生成できません

source: cannot generate systemd conf user configuration file
ca: no s'ha pogut generar el fitxer de configuració de l'usuari «systemd conf»
ja: systemd confユーザ設定ファイルを生成できません

source: Setting up proxy with configuration %s
ca: S'està configurant el servidor intermediari amb configuració %s
fr: Installation du proxy avec la configuration %s
ja: 設定 %s でプロキシを設定しています

source: failed to extract proxy config from %s file
ca: no s'ha pogut extreure la configuració del servidor intermediari del fitxer %s
ja: プロキシ設定を %s ファイルから抽出できませんでした

source: No tarball provided. Will check existing configuration files.
ca: No s'ha proporcionat cap tarball. Comprovarà els fitxers de configuració existents.
ja: tarballは提供されていません。既存の設定ファイルを確認します。

source: %s directory has no required permissions. Check your umask settings
ca: El directori %s no té permisos necessaris. Comproveu la configuració de l'umask
ja: %s ディレクトリに必要な権限がありません。umask設定を確認してください

source: %s file has no required permissions. Check your umask settings
ca: El fitxer %s no té permisos necessaris. Comproveu la configuració de l'umask
ja: %s ファイルに必要な権限がありません。umask設定を確認してください

source: missing required configuration file: %s
ca: falta el fitxer de configuració requerit: %s
ja: 必要な設定ファイルが見つかりません: %s

source: Not a system id event
ca: No és un esdeveniment d'ID del sistema

source: System id not found in returned event
ca: No s'ha trobat l'ID del sistema a l'esdeveniment retornat

source: argument is not an existing file: %s
ca: l'argument no és un fitxer existent: %s
fr: le paramètre n'est pas un fichier existant: %s
ja: 引数は既存のファイルではありません: %s

source: Invalid proxy container name: %s
ca: El nom del contenidor del servidor intermediari no és vàlid: %s
fr: Nom de conteneur de proxy invalide: %s
ja: 無効なプロキシコンテナ名: %s

source: failed to compute image URL
ca: no s'ha pogut calcular l'URL de la imatge
ja: イメージURLの計算に失敗しました

source: SUSE Customer Center username. It will be used to pull images from SCC registry
ca: Nom d'usuari del Centre de clients de SUSE. S'usarà per obtenir imatges del registre SCC.

source: SUSE Customer Center password. It will be used to pull images from SCC registry
ca: Contrasenya del Centre de clients de SUSE. S'usarà per extreure imatges del registre SCC.

source: SUSE Customer Center Flags
ca: Banderes del Centre de Clients SUSE
ja: SUSEカスタマーセンターのフラグ

source: image tag
ca: etiqueta de la imatge
fr: tag de l'image
ja: イメージタグ

source: HTTPD tuning configuration file
ca: Fitxer de configuració d'afinació HTTPD
ja: HTTPDチューニング設定ファイル

source: Squid tuning configuration file
ca: Fitxer de configuració de l'afinació del calamar
ja: Squidチューニング設定ファイル

source: Image for %s container
ca: Imatge per al contenidor %s
ja: %s コンテナのイメージ

source: Tag for %s container, overrides the global value if set
ca: Etiqueta per al contenidor %s, anul·la el valor global si s'estableix
fr: Tag pour le conteneur %sm remplace la valeur globale si définie
ja: %s コンテナ用のタグ。設定されている場合はグローバル値を上書きします

source: failed to create temporary directory: %s
fr: impossible de créer le répertoire temporaire: %s

source: cannot deploy proxy helm chart: %s
fr: impossible de déployer le helm chart du proxy: %s

source: Install a new proxy on podman It only takes the path to the configuration tarball generated by the server as parameter. The install podman command assumes podman is installed locally. NOTE: for now installing on a remote podman is not supported!
fr: Installer un nouveau proxy sur podman Ne prend que le chemin vers l'archive de configuration générée par le serveur comme paramètre. La command install podman suppose que podman est installé en local. NOTE: pour l'instant l'installation sur un podman distant n'est pas supportée!

source: failed to extract proxy config from %s file: %s
fr: impossible d'extraire la configuration du proxy du fichier %s: %s

source: cannot inspect host values: %s
fr: impossible d'inspecter les valeurs de l'hôte: %s

source: cannot delete volume %s: %s
fr: impossible de suppimer le volume %s: %s

source: failed to determine suitable backend: %s
fr: impossible de déterminer le back-end à utiliser: %s

source: Actually remove the proxy
fr: Réellement supprimer le proxy

source: Also remove the volumes
fr: Supprimer également les volumes

source: failed to discover the cluster type: %s
fr: impossible de détecter le type de cluster: %s

source: no uyuni-proxy helm release installed on the cluster
fr: aucune release helm uyuni-proxy installée sur le cluster

source: failed to find the uyuni-proxy deployment namespace: %s
fr: impossible de trouver le namespace du déploiement de uyuni-proxy: %s

source: failed to get deployment status: %s
fr: impossible de déterminer l'état du déploiement: %s

source: Some replicas are not ready: %d / %d
fr: Certaines répliques ne sont pas prêtes: %d / %d

source: Welcome to %s
fr: Bienvenue à %s

source: Executing command: %s
fr: Exécution de la commande: %s

source: application log level
fr: niveau de verbosité de l'application

source: cannot run helm upgrade: %s
fr: impossible d'exécuter helm upgrade: %s

source: cannot setup network: %s
fr: impossible de configurer le réseau: %s

source: failed to generate systemd file: %s
fr: impossible de générer le fichier systemd: %s

source: Failed to compute image URL
fr: Impossible de calculer l'URL de l'image

source: registry URL prefix containing the all the container images
fr: prefixe de l'URL du registre contenant toutes les images de conteneurs

source: Image for %s container, overrides the namespace if set
fr: Image pour le conteneur %s, remplace le namespace is défini
