Repository: uyuni-project/uyuni-tools
Catalog: locale/mgrctl/*.po
Languages: ca, ja

source: JSON over HTTP API helper tool
ca: JSON sobre l'eina d'ajuda de l'API HTTP
ja: JSON over HTTP APIヘルパーツール

source: Call API GET request
ca: Truca a l'API per obtenir la sol·licitud
ja: API GET要求を呼び出す

source: Takes an API path and optional parameters and then issues GET request with them. Example: # mgrctl api get user/getDetails login=test
ca: Pren un camí API i paràmetres opcionals i després emet sol·licitud GET amb ells. Exemple: mgrctl api get user/getDetails login=test
ja: APIパスとオプションパラメータを受け取り、これらを使用してGET要求を発行します。 例: # mgrctl api get user/getDetails login=test

source: Call API POST request
ca: Truca a la sol·licitud de l'API
ja: API POST要求を呼び出す

source: Takes an API path and parameters and then issues POST request with them. Parameters can be either JSON encoded string or one or more key=value pairs. Key=Value pairs example: # mgrctl api post user/create login=test password=testXX firstName=F lastName=L email=test@localhost JSON example: # mgrctl api post user/create '{"login":"test", "password":"testXX", "firstName":"F", "lastName":"L", "email":"test@localhost"}'
ca: Pren un camí i paràmetres de l'API i després emet la sol·licitud POST amb ells. Els paràmetres poden ser una cadena codificada JSON o un o més parells clauvaluevalor. Exemple de parells de valors: mgrctl api post user/create login/test passwordtetestX firstName F lastName L email test@localhost Exemple JSON: ", mgrctl api post user/create '{"login":"test", "password":"testXX", "firstName":"F", "lastName":"L", "email":"test@localhost"}'
ja: APIパスとパラメータを受け取り、これらを使用してPOST要求を発行します。 パラメータは、JSONでエンコードされた文字列または1つ以上のキー=値のペアのいずれかになります。 キー=値のペアの例: # mgrctl api post user/create login=test password=testXX firstName=F lastName=L email=test@localhost JSONの例: # mgrctl api post user/create '{"login":"test", "password":"testXX", "firstName":"F", "lastName":"L", "email":"test@localhost"}'

source: Store login information for future API usage
ca: Emmagatzema la informació d'inici de sessió per a l'ús futur de l'API
ja: 将来のAPI使用のためにログイン情報を保存する

source: Login stores login information for next API calls. User name, password and remote host can be provided using flags or will be asked interactively. Environment variables are also supported.
ca: L'inici de sessió emmagatzema informació d'inici de sessió per a les properes trucades de l'API. El nom d'usuari, la contrasenya i l'amfitrió remot es poden proporcionar utilitzant banderes o es demanaran interactivament. Les variables d'entorn també són compatibles.
ja: ログインすると、次のAPI呼び出しのためのログイン情報が保存されます。 ユーザ名、パスワード、リモート ホストは、フラグを使用して指定することも、対話形式で尋ねることもできます。 環境変数もサポートされています。

source: Overwrite existing login if exists
ca: Sobreescriu l'inici de sessió existent si existeix
ja: 既存のログインが存在する場合は上書きする

source: Remove stored login information
ca: Elimina la informació d'inici de sessió emmagatzemada
ja: 保存されているログイン情報を削除する

source: Logout removes stored login information.
ca: La sortida elimina la informació d'inici de sessió emmagatzemada.
ja: ログアウトすると、保存されているログイン情報が削除されます。

source: unable to login to the server
ca: no s'ha pogut iniciar la sessió al servidor
ja: サーバにログインできません

source: error in query '%s'
ca: s'ha produït un error en la consulta «%s»
ja: クエリ「%s」でエラーが発生しました

source: Refusing to overwrite existing login. Use --force to ignore this check.
ca: S'està negant a sobreescriure l'inici de sessió existent. Utilitzeu --force per a ignorar aquesta comprovació.
ja: 既存のログインの上書きを拒否します。このチェックを無視するには--forceを使用します。

source: Failed to validate credentials.
ca: No s'han pogut validar les credencials.
ja: 資格情報の検証に失敗しました。

source: Login credentials verified.
ca: S'han verificat les credencials d'inici de sessió.
ja: ログイン資格情報が確認されました。

source: Successfully logged out
ca: S'ha tancat la sessió correctament
ja: 正常にログアウトしました

source: Uyuni control tool
ca: Eina de control Uyuni
ja: Uyuni制御ツール

source: Tool to help managing Uyuni servers mainly through their API
ca: Eina per ajudar a gestionar els servidors Uyuni principalment a través de la seva API
ja: 主にAPIを通じてUyuniサーバを管理するのに役立つツール

source: configuration file path
ca: camí del fitxer de configuració
ja: 設定ファイルパス

source: application log level
ca: nivell de registre de l'aplicació
ja: アプリケーションログレベル

source: Welcome to %s
ca: Us donem la benvinguda a %s
ja: %s へようこそ

source: Executing command: %s
ca: S'està executant l'ordre: %s
ja: コマンドの実行中: %s

source: Copy files to and from the containers
ca: Copia els fitxers als contenidors i dels contenidors
ja: コンテナへのファイルのコピーとコンテナからのファイルのコピー

source: Takes a source and destination parameters. One of them can be prefixed with 'server:' to indicate the path is within the server pod.
ca: Pren paràmetres d'origen i de destinació. Un d'ells es pot prefixar amb 'servidor:' per indicar que el camí està dins del pod del servidor.
ja: ソースと宛先のパラメータを受け取ります。 そのうちの1つに 「server:」というプレフィックスを付けて、 そのパスがサーバポッド内にあることを示すことができます。

source: failed to unmarshall configuration
ca: no s'ha pogut desfer la configuració del «marshall»
ja: 設定のアンマーシャルに失敗しました

source: User or UID to set on the destination file
ca: Usuari o UID a establir al fitxer de destinació
ja: 宛先ファイルに設定するユーザまたはUID

source: Group or GID to set on the destination file
ca: Grup o GID a establir al fitxer de destinació
ja: 宛先ファイルに設定するグループまたはGID

source: Execute commands inside the uyuni containers using 'sh -c'
ca: Executa les ordres dins dels contenidors uyuni utilitzant «sh -c»
ja: uyuniコンテナンテナ内で 「sh -c」を使用してコマンドを実行する

source: environment variables to pass to the command, separated by commas
ca: variables d'entorn a passar a l'ordre, separades per comes
ja: カンマで区切ってコマンドに渡す環境変数

source: Pass stdin to the container
ca: Passa l'entrada estàndard al contenidor
ja: コンテナにstdinを渡す

source: Stdin is a TTY
ca: Stdin és un TTY
ja: StdinはTTYです

source: Command failed
ca: Ha fallat l'ordre
ja: コマンドが失敗しました

source: Command returned with exit code 0
ca: L'ordre ha retornat amb el codi de sortida 0
ja: コマンドは終了コード0で返されました

source: cannot write
ca: no es pot escriure
ja: 書き込めません

source: Running %s
ca: S'està executant %s
ja: %s を実行中

source: Create a proxy configuration file
ca: Crea un fitxer de configuració del servidor intermediari
ja: プロキシ設定ファイルの作成

source: Filename to write the configuration to (without extension).
ca: Nom de fitxer on escriure la configuració (sense extensió).
ja: 設定を書き込むファイル名(拡張子なし)。

source: Unique DNS-resolvable FQDN of this proxy.
ca: FQDN únic solucionable amb DNS d'aquest servidor intermediari.
ja: このプロキシの固有のDNS解決可能FQDN。

source: SSH port the proxy listens on.
ca: El port SSH on escolta el servidor intermediari.
ja: プロキシがリスンするSSHポート。

source: FQDN of the server to connect the proxy to.
ca: FQDN del servidor on connectar el servidor intermediari.
ja: プロキシを接続するサーバのFQDN。

source: Maximum cache size in MB.
ca: Mida màxima de la memòria cau en MB.
ja: 最大キャッシュサイズ(MB)。

source: Email of the proxy administrator
ca: Correu electrònic de l'administrador del servidor intermediari
ja: プロキシ管理者の電子メール

source: Path to the root CA certificate in PEM format.
ca: Camí al certificat CA arrel en format PEM.
ja: PEM形式のルートCA証明書へのパス。

source: Path to the proxy certificate in PEM format.
ca: Camí al certificat intermediari en format PEM.
ja: PEM形式のプロキシ証明書へのパス。

source: Path to the proxy certificate private key in PEM format.
ca: Camí a la clau privada del certificat intermediari en format PEM.
ja: PEM形式のプロキシ証明書機密鍵へのパス。

source: Path to an intermediate CA used to sign the proxy certicate in PEM format. May be provided multiple times or separated by commas.
ca: Camí a una CA intermèdia utilitzada per signar el certificat proxy en format PEM. Es pot proporcionar diverses vegades o separar per comes.
ja: PEM形式のプロキシ証明書に署名するために使用される中間CAへのパス。 複数回指定することも、カンマで区切ることもできます。

source: Email to set in the SSL certificate
ca: Correu electrònic a establir al certificat SSL
ja: SSL証明書に設定する電子メールアドレス

source: Path to the private key of the CA to use to generate a new proxy certificate.
ca: Camí a la clau privada de la CA a utilitzar per generar un certificat intermediari nou.
ja: 新しいプロキシ証明書の生成に使用するCAの機密鍵へのパス。

source: Password of the CA private key, will be prompted if not passed.
ca: Contrasenya de la clau privada de la CA, es preguntarà si no s'ha passat.
ja: CA機密鍵のパスワード。渡されていない場合は入力を求められます。

source: Common Flags
ca: Banderes comunes
ja: 共通フラグ

source: Third party proxy certificates flags
ca: Indicadors de certificats intermediaris de tercers
ja: サードパーティのプロキシ証明書フラグ

source: failed to connect to the server
ca: no s'ha pogut connectar al servidor
ja: サーバへの接続に失敗しました

source: failed to execute proxy configuration api request
ca: no s'ha pogut executar la petició api de configuració del servidor intermediari
ja: プロキシ設定API要求の実行に失敗しました

source: error saving binary data: %v
ca: s'ha produït un error en desar les dades binàries: %v
ja: バイナリデータの保存中にエラーが発生しました: %v

source: Proxy configuration file saved as %s
ca: S'ha desat el fitxer de configuració del servidor intermediari com a %s
ja: プロキシ設定ファイルが %s として保存されました

source: flag proxyKey is required when flag proxyCrt is provided
ca: flag proxyKey es requereix quan es proporciona flag proxyCrt
ja: フラグproxyCrtが指定されている場合は、フラグproxyKeyが必要です

source: Please enter SSL CA password
ca: Introduïu la contrasenya de la CA SSL
ja: SSL CAパスワードを入力してください

source: Manage proxy configurations
ca: Gestiona les configuracions del servidor intermediari
ja: プロキシ設定の管理

source: Create proxy configurations
ca: Crea configuracions del servidor intermediari
ja: プロキシ設定の作成

source: Run a terminal inside the server container
ca: Executa un terminal dins del contenidor del servidor
ja: サーバコンテナ内で端末を実行する
