Repository: uyuni-project/uyuni-tools
Catalog: locale/shared/*.po
Languages: ca, ja

source: FQDN of the server to connect to
ca: FQDN del servidor al qual connectar
ja: 接続先サーバのFQDN

source: API user username
ca: Nom d'usuari de l'API
ja: APIユーザのユーザ名

source: Password for the API user
ca: Contrasenya per a l'usuari API
ja: APIユーザのパスワード

source: Path to a cert file of the CA
ca: Camí a un fitxer de certificat de la CA
ja: CAの証明書ファイルへのパス

source: If set, server certificate will not be checked for validity
ca: Si s'estableix, el certificat del servidor no es comprovarà si hi ha validesa
ja: 設定されている場合、サーバ証明書は有効性をチェックされません

source: 401: unauthorized
ca: 401: no autoritzat
ja: 401: 権限がありません

source: unknown error: %d
ca: error desconegut: %d
ja: 不明なエラー: %d

source: server URL is not provided
ca: no s'ha proporcionat l'URL del servidor
ja: サーバURLが提供されていません

source: Cached session is expired.
ca: La sessió a la memòria cau ha expirat.
ja: キャッシュされたセッションの有効期限が切れています。

source: Failed to remove stored credentials!
ca: No s'han pogut eliminar les credencials emmagatzemades!
ja: 保存されている資格情報の削除に失敗しました。

source: Unable to create login data
ca: No s'han pogut crear les dades d'inici de sessió
ja: ログインデータを作成できません

source: auth cookie not found in login response
ca: no s'ha trobat la galeta d'autenticació a la resposta d'inici de sessió
ja: ログイン応答に認証クッキーが見つかりません

source: failed to logout from the server
ca: no s'ha pogut sortir del servidor
ja: サーバからのログアウトに失敗しました

source: Unable to convert data to JSON
ca: No s'han pogut convertir les dades a JSON
ja: データをJSONに変換できません

source: not logged in, session cookie is missing
ca: no s'ha iniciat la sessió, manca la galeta de sessió
ja: ログインしていません。セッションクッキーがありません

source: unable to create credentials json
ca: no s'han pogut crear les credencials json
ja: 資格情報jsonを作成できません

source: unable to write credentials store %s
ca: no s'han pogut escriure les credencials del magatzem %s
ja: 資格情報ストア %s に書き込めません

source: API server URL
ca: URL del servidor API
ja: APIサーバのURL

source: API server user
ca: Usuari del servidor API
ja: APIサーバのユーザ

source: API server password
ca: Contrasenya del servidor API
ja: APIサーバのパスワード

source: No credentials provided
ca: No s'han proporcionat credencials
ja: 資格情報が提供されていません

source: Cannot load stored credentials
ca: No es poden carregar les credencials emmagatzemades
ja: 保存されている資格情報をロードできません

source: unable to read credentials file %s
ca: no s'ha pogut llegir el fitxer de credencials %s
ja: 資格情報ファイル %s を読み込めません

source: unable to decode credentials file
ca: no s'ha pogut descodificar el fitxer de credencials
ja: 資格情報ファイルをデコードできません

source: no credentials loaded
ca: no s'ha carregat cap credencial
ja: 資格情報がロードされていません

source: specified api server does not match with stored credentials
ca: el servidor api especificat no coincideix amb les credencials emmagatzemades
ja: 指定されたAPIサーバが、保存されている資格情報と一致しません

source: unable to prepare API client
ca: no s'ha pogut preparar el client API
ja: APIクライアントを準備できません

source: failed to create first user and organization
ca: no s'ha pogut crear el primer usuari i organització
ja: 最初のユーザと組織の作成に失敗しました

source: failed to connect to the server
ca: no s'ha pogut connectar al servidor
ja: サーバへの接続に失敗しました

source: failed to get organization details
ca: no s'han pogut obtenir els detalls de l'organització
ja: 組織の詳細の取得に失敗しました

source: failed to create proxy configuration file
ca: ha fallat en crear el fitxer de configuració del servidor intermediari
ja: プロキシ設定ファイル の作成に失敗しました

source: Generate shell completion script
ca: Genera l'script de compleció de l'intèrpret d'ordres
ja: シェル補完スクリプトの生成

source: cannot generate %s completion
ca: no es pot generar la compleció %s
ja: %s 完了を生成できません

source: backend command not found in PATH: %s
ca: no s'ha trobat l'ordre del dorsal al PATH: %s
ja: バックエンドコマンドがPATHに見つかりません: %s

source: kubectl not configured to connect to a cluster, ignoring
ca: El kubectl no està configurat per a connectar a un clúster, s'ignorarà
ja: クラスタに接続するようにkubectlが設定されていません。無視します

source: uyuni container is not accessible with one of podman, podman-remote or kubectl
ca: el contenidor uyuni no és accessible amb un de podman, podman-remote o kubectl
ja: uyuniコンテナは、podman、podman-remote、またはkubectlのいずれかでアクセスできません

source: unsupported backend %s
ca: el dorsal %s no està suportat
ja: サポートされていないバックエンド %s

source: coundn't find app name
ca: no s'ha trobat el nom de l'aplicació
ja: アプリ名が見つかりませんでした

source: failed to guest namespace
ca: no s'ha pogut convidar l'espai de noms
ja: ゲストネームスペースに失敗しました

source: container %s is not running on podman
ca: el contenidor %s no s'està executant a podman
ja: コンテナ %s はpodmanで実行されていません

source: container labeled %s is not running on kubectl
ca: el contenidor etiquetat %s no s'està executant al kubectl
ja: %s というラベルのコンテナはkubectlで実行されていません

source: %s command not executed:
ca: Ordre %s no executada:
ja: %s コマンドは実行されませんでした:

source: failed to retrieve namespace
ca: no s'ha pogut recuperar l'espai de noms
ja: ネームスペースを取得できませんでした

source: Healthcheck not executed
ca: Comprovació de salut no executada
ja: ヘルスチェックは実行されませんでした

source: container didn't start within 10s.
ca: el contenidor no va començar en 10 anys.
ja: コンテナが10秒以内に起動しませんでした。

source: container didn't start within 120s. Check for the service status
ca: el contenidor no s'ha iniciat en 120 segons. Comproveu l'estat del servei.

source: unknown container kind: %s
ca: tipus de contenidor desconegut: %s
ja: 不明なコンテナの種類: %s

source: failed to detect the namespace
ca: no s'ha pogut detectar l'espai de noms
ja: ネームスペースの検出に失敗しました

source: Copying the SSL CA certificate to the host
ca: S'està copiant el certificat SSL CA a l'amfitrió
ja: ホストへのSSL CA証明書のコピー

source: Updating host trusted certificates
ca: S'estan actualitzant els certificats de confiança de l'amfitrió
ja: ホストの信頼済み証明書の更新

source: Unable to update host trusted certificates.
ca: No s'han pogut actualitzar els certificats de confiança de l'amfitrió.
ja: ホストの信頼済み証明書を更新できません。

source: failed to determine suitable backend
ca: no s'ha pogut determinar el dorsal adequat
ja: 適切なバックエンドを決定できませんでした

source: no supported backend found
ca: no s'ha trobat cap dorsal compatible
ja: サポートされているバックエンドが見つかりません

source: Running supportconfig in %s
ca: S'està executant supportconfig a %s
ja: %s でsupportconfigを実行しています

source: failed to run supportconfig
ca: no s'ha pogut executar supportconfig
ja: supportconfigの実行に失敗しました

source: failed to find container supportconfig tarball from command output
ca: no s'ha pogut trobar el contenidor supportconfig tarball des de la sortida d'ordres
ja: コマンド出力からコンテナのsupportconfig tarballが見つかりませんでした

source: cannot copy tarball
ca: no es pot copiar el fitxer tar
ja: tarballをコピーできません

source: failed to remove %s file in the container
ca: no s'ha pogut eliminar el fitxer %s al contenidor
ja: コンテナ内の %s ファイルの削除に失敗しました

source: failed to create %s YAML file
ca: no s'ha pogut crear el fitxer YAML %s
ja: %s YAMLファイルの作成に失敗しました

source: failed to close %s YAML file
ca: no s'ha pogut tancar el fitxer YAML %s
ja: %s YAMLファイルを閉じることができませんでした

source: failed to write PVC to file
ca: no s'ha pogut escriure el PVC al fitxer
ja: PVCのファイルへの書き込みに失敗しました

source: failed to upgrade helm chart %[1]s in namespace %[2]s
ca: no s'ha pogut actualitzar el diagrama de helm %[1]s a l'espai de noms %[2]s
ja: helmチャート %[1]s (ネームスペース %[2]s 内)のアップグレードに失敗しました

source: failed to install helm chart %[1]s in namespace %[2]s
ca: no s'ha pogut instal·lar el diagrama de helm %[1]s a l'espai de noms %[2]s
ja: helmチャート %[1]s (ネームスペース %[2]s 内)のインストールに失敗しました

source: namespace is required
ca: l'espai de noms és obligatori
ja: ネームスペースが必要です

source: Would run %s
ca: S'executaria %s
ja: %s を実行します

source: Uninstalling %s
ca: S'està desinstal·lant %s
ja: %s をアンインストールしています

source: failed to run helm %s
ca: no s'ha pogut executar el timó %s
ja: helm %s の実行に失敗しました

source: failed to parse the inspected data
ca: no s'han pogut analitzar les dades inspeccionades
ja: 検査データの解析に失敗しました

source: Installing K3s Traefik configuration
ca: S'està instal·lant la configuració del Traefik del K3s
ja: K3s Traefik設定のインストール

source: Failed to write Traefik configuration
ca: No s'ha pogut escriure la configuració del Traefik
ja: Traefik設定の書き込みに失敗しました

source: Waiting for Traefik to be reloaded
ca: S'està esperant que el Traefik es torni a carregar
ja: Traefikの再ロードを待機中

source: Failed to reload Traefik
ca: No s'ha pogut tornar a carregar el Traefik
ja: Traefikの再ロードに失敗しました

source: Reinstalling Traefik without additionnal configuration
ca: Reinstal·lació de Traefik sense configuració additiva
ja: 追加の設定なしでTraefikを再インストール

source: failed to write empty traefik configuration
ca: no s'ha pogut escriure la configuració de traefik buida
ja: 空のTraefik設定の書き込みに失敗しました

source: failed to uninstall traefik configuration
ca: no s'ha pogut desinstal·lar la configuració del traefik
ja: Traefik設定のアンインストールに失敗しました

source: Would reinstall Traefik without additionnal configuration
ca: Reinstal·laria Traefik sense configuració addicional
ja: 追加の設定なしでTraefikを再インストールします

source: failed to read the traefik configuration
ca: no s'ha pogut llegir la configuració del traefik
ja: Traefik設定の読み込みに失敗しました

source: traefik configuration file doesn't contain the helm chart version
ca: El fitxer de configuració de traefik no conté la versió del diagrama de helm
ja: traefik設定ファイルにhelmチャートバージョンが含まれていません

source: failed to find traefik helm chart version
ca: no s'ha pogut trobar la versió del diagrama de helm de traefik
ja: traefik helmチャートバージョンが見つかりませんでした

source: failed to get kubelet version
ca: no s'ha pogut obtenir la versió del kubelet
ja: kubeletバージョンの取得に失敗しました

source: failed to get pod commands to look for nginx controller
ca: no s'han pogut obtenir les ordres pod per a cercar el controlador nginx
ja: nginxコントローラを探すためのポッドコマンドの取得に失敗しました

source: cannot stop %s
ca: no es pot aturar %s
ja: %s を停止できません

source: failed to run kubectl get configMap %[1]s %[2]s
ca: no s'ha pogut executar el kubectl get configMap %[1]s %[2]s
ja: kubectl get configMap %[1]s %[2]s に失敗しました

source: failed to run kubectl get secret %[1]s %[2]s
ca: no s'ha pogut executar el kubectl get secret %[1]s %[2]s
ja: kubectl get secret %[1]s %[2]s の実行に失敗しました

source: Failed to base64 decode secret %s
ca: No s'ha pogut descodificar en base64 el secret %s
ja: シークレット %s のbase64デコードに失敗しました

source: failed to create the %s docker secret
ca: no s'ha pogut crear el secret de l'acoblador %s
ja: %s Dockerシークレットの作成に失敗しました

source: failed to get deployment image pull secret
ca: no s'ha pogut obtenir el secret d'extracció de la imatge de desplegament
ja: 配備イメージのプルシークレットの取得に失敗しました

source: failed to run the %s pod
ca: no s'ha pogut executar el pod %s
ja: %s ポッドの実行に失敗しました

source: failed to get the %s pod logs
ca: No s'han pogut obtenir els registres del pod %s
ja: %s ポッドログの取得に失敗しました

source: failed to delete the %s pod
ca: no s'ha pogut suprimir el pod %s
ja: %s ポッドの削除に失敗しました

source: failed to create %s persistent volume claim
ca: no s'ha pogut crear la reclamació de volum persistent %s
ja: %s 永続ボリュームのクレームの作成に失敗しました

source: failed to parse pv data
ca: no s'han pogut analitzar les dades pv
ja: pvデータの解析に失敗しました

source: the %[1]s volume has to reference the %[1]s claim in %[2]s namespace
ca: el volum %[1]s ha de fer referència a la reclamació %[1]s a l'espai de noms %[2]s
ja: %[1]s ボリュームは %[1]s クレームを参照する必要があります(%[2]s ネームスペース内)

source: failed to run the persistent volume claims
ca: no s'han pogut executar les reclamacions de volum persistents
ja: 永続ボリュームのクレームの実行に失敗しました

source: no size defined for PersistentVolumeClaim %s, using 10Mi as default
ca: no s'ha definit cap mida per a PersistentVolumeClaim %s, s'usarà 10Mi com a predeterminat
ja: PersistentVolumeClaim %s のサイズは定義されていません。デフォルトの10Miを使用します

source: Installing RKE2 Nginx configuration
ca: S'està instal·lant la configuració de RKE2 Nginx
ja: RKE2 Nginx設定のインストール

source: Failed to write Rke2 nginx configuration
ca: No s'ha pogut escriure la configuració de Nginx Rke2
ja: Rke2 nginx設定の書き込みに失敗しました

source: Waiting for Nginx controller to be reloaded
ca: S'està esperant que es torni a carregar el controlador Nginx
ja: Nginxコントローラが再ロードされるのを待機中

source: cannot retrieve any configmap
ca: no es pot recuperar cap mapa de configuració
ja: configmapを取得できません

source: cannot retrieve any pod
ca: no es pot recuperar cap pod
ja: ポッドを取得できません

source: cannot create %s
ca: no es pot crear %s
ja: %s を作成できません

source: cannot fetch configmap
ca: no s'ha pogut recuperar el mapa de configuració
ja: configmapをフェッチできません

source: cannot check for pods in %s
ca: no es pot comprovar si hi ha pods a %s
ja: %s でポッドを確認できません

source: failed to create %s
ca: no s'ha pogut crear %s
ja: %s の作成に失敗しました

source: failed to fetch info for pod %s
ca: no s'ha pogut obtenir la informació del pod %s
ja: ポッド %s の情報のフェッチに失敗しました

source: failed to write in %s
ca: no s'ha pogut escriure a %s
ja: %s への書き込みに失敗しました

source: Note that removing the volumes could also be handled automatically depending on the StorageClass used when installed on a kubernetes cluster. For instance on a default K3S install, the local-path-provider storage volumes will be automatically removed when deleting the deployment even if --purge-volumes argument is not used.
ca: Tingueu en compte que l'eliminació dels volums també es pot gestionar automàticament depenent de la classe d'emmagatzematge utilitzada quan s'instal·la en un clúster de kubernetes. Per exemple, en una instal·lació predeterminada del K3S, els volums d'emmagatzematge del proveïdor de camins locals seran s'eliminarà automàticament en suprimir el desplegament encara que no s'utilitzi l'argument --purge-volumes.
ja: ボリュームの削除は、kubernetesクラスタにインストールされたときに使用されるStorageClass によって自動的に処理される可能性あることにも注意してください。 たとえば、デフォルトのK3Sインストールでは、local-path-providerストレージボリュームは、 --purge-volumes引数が使用されていなくても、配備を削除するときに自動的に削除されます。

source: Waiting for %[1]s deployment to be ready in %[2]s namespace
ca: S'està esperant que el desplegament %[1]s estigui llest a l'espai de noms %[2]s
ja: 単数形 %[1]s 配備の準備を待機中(%[2]s ネームスペース内) 複数形 %[1]s 配備の準備を待機中(%[2]s ネームスペース内)

source: Waiting for %[1]s deployment to be started in %[2]s namespace
ca: S'està esperant que s'iniciï el desplegament %[1]s a l'espai de noms %[2]s
ja: %[1]s 配備の準備を待機中(%[2]s ネームスペース内)

source: failed to check if the deployment has running pods
ca: no s'ha pogut comprovar si el desplegament té pods en execució
ja: 配備に実行中のポッドがあるかどうかを確認できませんでした

source: all the pods of %s deployment have a failure
ca: tots els pods del desplegament %s tenen un error
ja: %s 配備のすべてのポッドに障害が発生しました

source: failed to list ReplicaSets for deployment %s
ca: no s'ha pogut llistar els ReplicaSets per al desplegament %s
ja: 配備 %s のReplicaSetsを一覧表示できませんでした

source: failed to get the %s deployment revision
ca: no s'ha pogut obtenir la revisió de desplegament %s
ja: %s 配備リビジョンを取得できませんでした

source: invalid replicasset response: :%s
ca: resposta del conjunt de rèpliques no vàlida: :%s
ja: 無効なreplicasset応答: :%s

source: failed to find pods for owner reference %s
ca: no s'han pogut trobar els pods per a la referència del propietari %s
ja: 所有者参照 %s のポッドが見つかりませんでした

source: failed to get the status of %s pod
ca: no s'ha pogut obtenir l'estat de %s pod
ja: %s ポッドのステータスを取得できませんでした

source: failed to parse deployment status
ca: no s'ha pogut analitzar l'estat del desplegament
ja: 配備ステータスの解析に失敗しました

source: cannot run kubectl %s
ca: no es pot executar el kubectl %s
ja: kubectl %s を実行できません

source: cannot check if pod %[1]s is running in app %[2]s
ca: no es pot comprovar si el pod %[1]s s'està executant a l'aplicació %[2]s
ja: ポッド %[1]sがアプリ %[2]s で実行中かどうかを確認できません

source: cannot execute %s
ca: no es pot executar %s
ja: %s を実行できません

source: invalid replicas result
ca: resultat de rèpliques no vàlid
ja: 無効なレプリカ結果

source: %s is not a valid image pull policy value
ca: %s no és un valor vàlid de política d'extracció d'imatges
ja: %s は有効なイメージプルポリシーの値ではありません

# The first placeholder is a command
source: cannot run %[1]s using image %[2]s
ca: no es pot executar %[1]s utilitzant la imatge %[2]s
ja: %[1]s を実行できません(イメージ %[2]s を使用)

source: cannot delete pod %s
ca: no es pot suprimir el pod %s
ja: ポッド %s を削除できません

source: cannot find node name matching filter %s
ca: no s'ha pogut trobar el nom del node que coincideix amb el filtre %s
ja: フィルタ %s に一致するノード名が見つかりません

source: cannot serialize pod definition override
ca: no s'ha pogut serialitzar la sobreescriptura de la definició del pod
ja: ポッド定義の上書きをシリアライズできません

source: %[1]s job failed, run kubectl logs -n %[2]s --tail=-1 -ljob-name=%[1]s for details
ca: %[1]s ha fallat la tasca, executeu els registres del kubectl -n %[2]s --tail,-1 -ljob-name,%[1]s per als detalls
ja: %[1]s ジョブが失敗しました。詳細については、kubectl logs -n %[2]s --tail=-1 -ljob-name=%[1]sを実行してください

source: %[1]s job failed to complete within %[2]d seconds
ca: %[1]s tasca no s'ha pogut completar en %[2]d segons
ja: %[1]s ジョブは %[2]d 秒以内に完了できませんでした

source: failed to get %s job status
ca: no s'ha pogut obtenir l'estat de la tasca %s
ja: %s ジョブステータスの取得に失敗しました

source: invalid job status response: '%s'
ca: la resposta a l'estat de la tasca no és vàlida: «%s»
ja: 無効なジョブステータス応答: 「%s」

source: failed to get %s pod status
ca: no s'ha pogut obtenir l'estat de %s pod
ja: %s ポッドステータスの取得に失敗しました

source: %[1]s pod failed with status %[2]s
ca: %[1]s pod ha fallat amb l'estat %[2]s
ja: %[1]s ポッドはステータス %[2]s で失敗しました

source: %[1]s pod failed to complete within %[2]d seconds
ca: %[1]s pod no s'ha pogut completar en %[2]d segons
ja: %[1]s ポッドは %[2]d 秒以内に完了できませんでした

source: failed to run inspect script in host system
ca: no s'ha pogut executar l'script d'inspecció en el sistema amfitrió
ja: ホストシステムで検査スクリプトを実行できませんでした

source: cannot inspect host data
ca: no es poden inspeccionar les dades de l'amfitrió
ja: ホストデータを検査できません

source: Ensure image %s is available
ca: Assegura que la imatge %s està disponible
ja: イメージ %s が使用可能であることを確認します

source: Pull Policy is always. Presence of RPM image will be checked and pulled from registry if not present
ca: La política de pícnic és sempre. La presència de la imatge RPM es comprovarà i es retirarà del registre si no hi és
ja: プルポリシーが常に適用されます。RPMイメージがあるかどうかがチェックされ、存在しない場合はレジストリからプルされます

source: Cannot use RPM image for %s
ca: No es pot utilitzar la imatge RPM per a %s
ja: %s のRPMイメージを使用できません

source: Using the %[1]s image loaded from the RPM instead of its online version %[2]s
ca: Utilitzant la imatge %[1]s carregada des del RPM en lloc de la seva versió en línia %[2]s
ja: RPM からロードされた %[1]s イメージを使用(オンラインバージョン %[2]s ではない)

source: Cannot find RPM image for %s
ca: No s'ha pogut trobar la imatge RPM per a %s
ja: %s のRPMイメージが見つかりません

source: image %s is missing and cannot be fetched
ca: manca la imatge %s i no es pot recuperar
ja: イメージ %s が見つからないのでフェッチできません

source: failed to determine image
ca: no s'ha pogut determinar la imatge
ja: イメージの決定に失敗しました

source: failed to find the image of the currently running server container
ca: no s'ha pogut trobar la imatge del contenidor del servidor actualment en execució
ja: 現在実行中のサーバコンテナのイメージが見つかりませんでした

source: failed to determine pgsql image
ca: no s'ha pogut determinar la imatge pgsql
ja: pgsqlイメージの決定に失敗しました

source: failed to find the image of the currently running db container
ca: no s'ha pogut trobar la imatge del contenidor de db en execució
ja: 現在実行中のdbコンテナのイメージが見つかりませんでした

source: Cannot correctly parse image name '%s', local image cannot be used
ca: No es pot analitzar correctament el nom de la imatge «%s», no es pot utilitzar la imatge local
ja: イメージ名「%s」を正しく解析できません。ローカルイメージを使用できません

source: cannot unmarshal image RPM metadata
ca: no es poden desfer les metadades RPM de la imatge
ja: イメージRPMメタデータをアンマーシャルできません

source: skipping loading image from RPM as %s doesn't exist
ca: s'omet la càrrega de la imatge des de l'RPM perquè %s no existeix
ja: %s が存在しないため、RPMからのイメージのロードをスキップします

source: Cannot unmarshal metadata file %s
ca: No es pot desfer el fitxer de metadades %s
ja: メタデータファイル %s をアンマーシャルできません

source: error parsing: %s
ca: s'ha produït un error en analitzar: %s
ja: 解析エラー: %s

source: failed to check if image %s has already been pulled
ca: no s'ha pogut comprovar si la imatge %s ja s'ha tirat
ja: イメージ %s がすでにプルされているかどうかの確認に失敗しました

source: %s should contains just lower case character, otherwise podman pull would fails
ca: %s hauria de contenir només un caràcter en minúscula, en cas contrari l'estirada de podman fallaria
ja: %s には小文字のみを含める必要があります。含めない場合、podmanのプルは失敗します

source: Running podman pull %s
ca: S'està executant la podman pull %s
ja: podmanのプル %s の実行中

source: Running podman image search --list-tags %s --format={{.Tag}}
ca: S'està executant la cerca d'imatges de podman --list-tags %s --format.{{.Tag}}
ja: podmanイメージ検索--list-tags %s --format={{.Tag}}の実行中

source: cannot find any tag for image %s
ca: no s'ha pogut trobar cap etiqueta per a la imatge %s
ja: イメージ %s のタグが見つかりません

source: Running podman ps --filter=name=%s --format={{ .Image }}
ca: S'està executant el podman ps --filter.name.%s --format.{{ .Imatge}}
ja: podman ps --filter=name=%s --format={{ .Image }}の実行中

source: cannot find any running image for container %s
ca: no s'ha pogut trobar cap imatge en execució per al contenidor %s
ja: コンテナ %s に対して実行中のイメージが見つかりません

source: Run %s
ca: Executa %s
ja: %s の実行

source: Failed to remove image %s
ca: No s'ha pogut eliminar la imatge %s
ja: イメージ %s の削除に失敗しました

source: Failed to export image %s
ca: No s'ha pogut exportar la imatge %s
ja: イメージ %s のエクスポートに失敗しました

source: Failed to restore image %s
ca: No s'ha pogut restaurar la imatge %s
ja: イメージ %s の復元に失敗しました

source: SCC credentials parameters will be used. SCC credentials from host will be ignored.
ca: S'utilitzaran els paràmetres de les credencials SCC. S'ignoraran les credencials SCC del servidor.
ja: SCC資格情報パラメータが使用されます。ホストからのSCC資格情報は無視されます。

source: failed to close the temporary auth file
ca: no s'ha pogut tancar el fitxer temporal d'autenticació
ja: 一時認証ファイルを閉じることができませんでした

source: Setting up %s network
ca: S'està configurant la xarxa %s
ja: %s ネットワークの設定

source: %s network doesn't have IPv6, deleting existing network to enable IPv6 on it
ca: La xarxa %s no té IPv6, esborrant la xarxa existent per habilitar-hi IPv6
ja: %s ネットワークにはIPv6がありません。既存のネットワークを削除してIPv6を有効にします

source: failed to remove %s podman network
ca: no s'ha pogut eliminar la xarxa podman de %s
ja: %s podmanネットワークの削除に失敗しました

source: Reusing existing %s network
ca: S'està reutilitzant la xarxa %s existent
ja: 既存の %s ネットワークの再利用

source: failed to find podman's network backend
ca: no s'ha pogut trobar el dorsal de xarxa de podman
ja: podmanのネットワークバックエンドが見つかりませんでした

source: Podman's network backend (%[1]s) is not netavark, skipping IPv6 enabling on %[2]s network
ca: El dorsal de xarxa de Podman (%[1]s) no és netavark, s'omet l'habilitació IPv6 a la xarxa %[2]s
ja: Podmanのネットワークバックエンド (%[1]s) はnetavarkではありません。%[2]s ネットワークでのIPv6の有効化をスキップします

source: failed to create %s network with IPv6 enabled
ca: no s'ha pogut crear la xarxa %s amb IPv6 activat
ja: IPv6を有効にした %s ネットワークの作成に失敗しました

source: Network %s already removed
ca: La xarxa %s ja s'ha eliminat
ja: ネットワーク %s はすでに削除されています

source: Failed to remove network %s
ca: No s'ha pogut eliminar la xarxa %s
ja: ネットワーク %s の削除に失敗しました

source: Network removed
ca: S'ha suprimit la xarxa
ja: ネットワークが削除されました

source: failed to create %s secret
ca: no s'ha pogut crear el següent: %s secret
ja: %s シークレットの作成に失敗しました

source: failed to write %s secret to file
ca: no s'ha pogut escriure el secret %s al fitxer
ja: %s シークレットのファイルへの書き込みに失敗しました

source: failed to create podman secret %s
ca: no s'ha pogut crear el secret podman %s
ja: podmanシークレット %s の作成に失敗しました

source: Failed to delete %s secret
ca: No s'ha pogut suprimir el secret %s
ja: %s シークレットの削除に失敗しました

source: No logs file on host to add to the archive
ca: No hi ha cap fitxer de registre a l'amfitrió per afegir a l'arxiu.
ja: アーカイブに追加するログファイルがホストにありません
