Repository: uyuni-project/uyuni-tools
Catalog: locale/shared/*.po
Languages: ca, ja

source: No systemd file to add to the archive
ca: No hi ha cap fitxer «systemd» a afegir a l'arxiu
ja: アーカイブに追加するsystemdファイルはありません

source: failed to run podman inspect %s
ca: no s'ha pogut executar la podman inspect %s
ja: podman inspect %s の実行に失敗しました

source: failed to fetch the config files bound to container %s
ca: no s'han pogut recuperar els fitxers de configuració lligats al contenidor %s
ja: コンテナ %s にバインドされた設定ファイルのフェッチに失敗しました

source: failed to run podman logs %s
ca: no s'han pogut executar els registres podman %s
ja: podman logs %sの実行に失敗しました

source: failed to create %s file
ca: no s'ha pogut crear el fitxer %s
ja: %s ファイルの作成に失敗しました

source: failed to cat %s
ca: no s'ha pogut concatenar %s
ja: %s のcatに失敗しました

source: failed to run systemctl cat uyuni-*
ca: no s'ha pogut executar systemctl cat uyuni-*
ja: systemctl cat uyuni-*の実行に失敗しました

source: failed to close inspect dump file
ca: no s'ha pogut tancar el fitxer de bolcat d'inspeccions
ja: 検査ダンプファイルを閉じることができませんでした

source: failed to close bound files
ca: no s'han pogut tancar els fitxers lligats
ja: バンドルファイルを閉じることができませんでした

source: failed create %s file
ca: no s'ha pogut crear el fitxer %s
ja: %s ファイルの作成に失敗しました

source: failed to run journalctl -u %s
ca: no s'ha pogut executar journalctl -u %s
ja: ournalctl -u %sの実行に失敗しました

source: failed to disable %s systemd service
ca: no s'ha pogut inhabilitar el servei systemd %s
ja: %s systemdサービスを無効にできませんでした

source: failed to reset-failed systemd
ca: no s'ha pogut restablir el «systemd» fallit
ja: systemdのreset-failedに失敗しました

source: failed to reload systemd daemon
ca: no s'ha pogut tornar a carregar el dimoni del systemd
ja: systemdデーモンの再ロードに失敗しました

source: failed to restart systemd %s.service
ca: no s'ha pogut reiniciar systemd %s.service
ja: systemd %s.serviceの再起動に失敗しました

source: failed to start systemd %s.service
ca: no s'ha pogut iniciar systemd %s.service
ja: systemd %s.serviceの起動に失敗しました

source: failed to stop systemd %s.service
ca: no s'ha pogut aturar systemd %s.service
ja: systemd %s.serviceの停止に失敗しました

source: failed to enable %s systemd service
ca: no s'ha pogut habilitar el servei «systemd» de %s
ja: %s systemdサービスを有効にできませんでした

source: Failed to get the %[1]s property from %[2]s service
ca: Ha fallat obtenir la propietat de %[1]s des del servei %[2]s

source: Systemd has no %s.service unit
ca: El Systemd no té %s.unitat de servei
ja: Systemdには %s.serviceユニットがありません

source: Disable %s service
ca: Desactiva el servei %s
ja: %s サービスを無効にする

source: Would remove %s
ca: Eliminaria %s
ja: %s を削除します

source: Remove %s
ca: Elimina %s
ja: %s の削除

source: Failed to remove %s.service file
ca: No s'ha pogut eliminar el fitxer %s.service
ja: %s.serviceファイルの削除に失敗しました

source: Failed to remove %s file
ca: No s'ha pogut eliminar el fitxer %s
ja: ファイル %s の削除に失敗しました

source: Would remove %s if empty
ca: Eliminaria %s si està buit
ja: 空の場合は、%s を削除します

source: %s folder contains file created by the user. Please remove them when uninstallation is completed.
ca: La carpeta %s conté el fitxer creat per l'usuari. Si us plau, elimineu-los quan s'hagi completat la desinstal·lació.
ja: %s フォルダには、ユーザが作成したファイルが含まれます。アンインストール後にそれらのファイルを削除してください。

source: Would scale %s to 0 replicas
ca: S'escalaria %s a 0 rèpliques
ja: %s を0個のレプリカにスケールします

source: Failed to disable %s service
ca: No s'ha pogut desactivar el servei %s
ja: %s サービスを無効にできませんでした

source: Service %[1]s already has %[2]d replicas.
ca: El servei %[1]s ja té %[2]d rèpliques.
ja: サービス %[1]s にはすでに %[2]d 個のレプリカがあります。

source: Scale %[1]s from %[2]d to %[3]d replicas.
ca: Escala %[1]s de %[2]d a %[3]d rèpliques.
ja: %[1]s を %[2]d から %[3]d レプリカにスケールします。

source: cannot enable service
ca: no es pot activar el servei
ja: サービスを有効にできません

source: cannot disable service
ca: no es pot desactivar el servei
ja: サービスを無効にできませんでした

source: failed to create %s folder
ca: no s'ha pogut crear la carpeta %s
ja: %s フォルダの作成に失敗しました

source: cannot write %s file
ca: no es pot escriure el fitxer %s
ja: %s ファイルを書き込めません

source: failed to write %s file
ca: no s'ha pogut escriure el fitxer %s
ja: %s ファイルの書き込みに失敗しました

source: failed to remove old %s systemd service configuration file
ca: no s'ha pogut eliminar l'antic fitxer de configuració del servei systemd %s
ja: 古い %s systemdサービス設定ファイルの削除に失敗しました

source: Extra arguments to pass to podman
ca: Arguments addicionals a passar a podman
ja: podmanに渡す追加引数

source: failed to enable podman.socket unit
ca: no s'ha pogut habilitar la unitat podman.socket
ja: podman.socketユニットの有効化に失敗しました

source: failed to run %s container
ca: no s'ha pogut executar el contenidor %s
ja: %s コンテナの実行に失敗しました

source: Would run podman kill %[1]s for container id %[2]s
ca: S'executaria podman kill %[1]s per a l'ID de contenidor %[2]s
ja: podman kill %[1]s を実行します (コンテナID %[2]s に対して)

source: Would run podman remove %[1]s for container id %[2]s
ca: S'executaria podman remove %[1]s per a l'ID de contenidor %[2]s
ja: podman remove %[1]s を実行します(コンテナID %[2]s に対して)

source: Run podman kill %[1]s for container id %[2]s
ca: Executa podman kill %[1]s per a l'ID de contenidor %[2]s
ja: podman kill %[1]s を実行します(コンテナID %[2]s に対して)

source: Failed to kill the server
ca: No s'ha pogut matar el servidor
ja: サーバの強制終了に失敗しました

source: Run podman remove %[1]s for container id %[2]s
ca: Executa podman remove %[1]s per a l'ID de contenidor %[2]s
ja: podman remove %[1]s を実行します(コンテナID %[2]s に対して)

source: Error removing container
ca: S'ha produït un error en eliminar el contenidor
ja: コンテナ削除エラー

source: Container already removed
ca: Contenidor ja eliminat
ja: コンテナはすでに削除されています

source: failed to get %s systemd service definition
ca: no s'ha pogut obtenir la definició del servei systemd de %s
ja: %s systemdサービス定義の取得に失敗しました

source: no UYUNI.*_IMAGE defined in %s systemd service
ca: no hi ha UYUNI.*_IMAGE definit al servei de systemd %s

source: Volume %s is externally mounted, directory cannot be removed
ca: El volum %s està muntat externament, no es pot eliminar el directori
ja: ボリューム %s は外部にマウントされているため、ディレクトリを削除できません

source: Failed to export volume %s
ca: No s'ha pogut exportar el volum %s
ja: ボリューム %s のエクスポートに失敗しました

source: Failed to write checksum of volume %[1]s to the %[2]s
ca: No s'ha pogut escriure la suma de verificació del volum %[1]s a %[2]s
ja: ボリューム %[1]s のチェックサムを %[2]s に書き込めませんでした

source: Checksum does not match for volume %s
ca: La suma de verificació no coincideix per al volum %s
ja: ボリューム %s のチェックサムが一致しません

source: Failed to precreate empty volume %s
ca: No s'ha pogut precrear el volum buit %s
ja: 空のボリューム %s の事前作成に失敗しました

source: Failed to import volume %s
ca: No s'ha pogut importar el volum %s
ja: ボリューム %s のインポートに失敗しました

source: cannot inspect data
ca: no es poden inspeccionar les dades
ja: データを検査できません

source: SSL certificate cnames separated by commas
ca: Cnames de certificat SSL separats per comes
ja: カンマで区切られたSSL証明書のcnames

source: SSL certificate country
ca: país del certificat SSL
ja: SSL証明書の国

source: SSL certificate state
ca: Estat del certificat SSL
ja: SSL証明書の都道府県

source: SSL certificate city
ca: Ciutat del certificat SSL
ja: SSL証明書の市町村

source: SSL certificate organization
ca: Organització del certificat SSL
ja: SSL証明書の組織

source: SSL certificate organization unit
ca: Unitat d'organització del certificat SSL
ja: SSL証明書の組織単位

source: SSL Certificate Flags
ca: Banderes de certificat SSL
ja: SSL証明書フラグ

source: 3rd Party SSL Certificate Flags
ca: Banderes del certificat SSL de tercers

source: Intermediate CA certificate path for the database if different from the server one
ca: Camí del certificat CA intermedi per a la base de dades si és diferent de la del servidor

source: Root CA certificate path for the database if different from the server one
ca: Camí del certificat CA d'arrel per a la base de dades si és diferent de la del servidor

source: Database certificate path
ca: Camí del certificat de la base de dades

source: Database key path
ca: Camí de la clau de la base de dades

source: Failed to find a non-CA certificate
ca: No s'ha pogut trobar un certificat que no sigui de l'AC
ja: 非CA証明書の検索に失敗しました

source: expected to find a certificate, got none
ca: s'esperava trobar un certificat, no s'ha obtingut
ja: 証明書が見つかると予期していたが、何も見つかりませんでした

source: Failed to read certificate file %s
ca: No s'ha pogut llegir el fitxer de certificat %s
ja: 証明書ファイル %s の読み込みに失敗しました

source: Failed to extract data from certificate
ca: No s'han pogut extreure les dades del certificat
ja: 証明書からのデータ抽出に失敗しました

source: Failed to parse start date: %s
ca: No s'ha pogut analitzar la data d'inici: %s
ja: 開始日の解析に失敗しました: %s

source: Failed to parse end date: %s
ca: No s'ha pogut analitzar la data de finalització: %s
ja: 終了日の解析に失敗しました: %s

source: No CA found
ca: No s'ha trobat cap CA
ja: CAが見つかりません

source: No CA found for server certificate
ca: No s'ha trobat cap CA per al certificat del servidor
ja: サーバ証明書のCAが見つかりません

source: Missing CA with subject hash %s
ca: Falta la CA amb el resum de l'assumpte %s
ja: 件名ハッシュ %s のCAが見つかりません

source: server certificate is required
ca: es requereix el certificat del servidor
ja: サーバ証明書が必要です

source: server key is required
ca: es requereix la clau del servidor
ja: サーバキーが必要です

source: %s file is not accessible
ca: El fitxer %s no és accessible
ja: %s ファイルにアクセスできません

source: Source server SSL CA private key password
ca: Contrasenya de la clau privada de la CA del servidor d'origen
ja: ソースサーバSSL CA機密鍵パスワード

source: Failed to open openssl rsa process input stream
ca: No s'ha pogut obrir el flux d'entrada del procés opensl rsa
ja: openssl rsaプロセス入力ストリームを開けませんでした

source: Failed to write openssl key content to input stream
ca: No s'ha pogut escriure el contingut de la clau opensl al flux d'entrada
ja: opensslキーコンテンツを入力ストリームに書き込めませんでした

source: Failed to convert CA private key to RSA
ca: No s'ha pogut convertir la clau privada CA a RSA
ja: CA機密鍵のRSAへの変換に失敗しました

source: Failed to open openssl x509 process input stream
ca: No s'ha pogut obrir el flux d'entrada del procés openssl x509
ja: openssl x509プロセス入力ストリームを開けませんでした

source: Failed to write SSL certificate to input stream
ca: No s'ha pogut escriure el certificat SSL al flux d'entrada
ja: SSL証明書を入力ストリームに書き込めませんでした

source: failed to strip text part from CA certificate
ca: no s'ha pogut suprimir la part de text del certificat de la CA
ja: CA証明書からテキスト部分を削除できませんでした

source: Invalid SSL key, it is probably encrypted
ca: Clau SSL no vàlida, probablement està encriptada
ja: SSLキーが無効です。暗号化されている可能性があります

source: failed to unmarshall configuration
ca: no s'ha pogut desfer la configuració del «marshall»
ja: 設定のアンマーシャルに失敗しました

source: tool to use to reach the container. Possible values: 'podman', 'podman-remote', 'kubectl'. Default guesses which to use.
ca: eina a utilitzar per arribar al contenidor. Valors possibles: 'podman', 'podman-remote', 'kubectl'. Endevinacions predeterminades que s'han d'utilitzar.
ja: コンテナに到達するために使用するツール。指定できる値:「podman」、「podman-remote」、「kubectl」。 デフォルトではどれを使用するかを推測します。

source: set whether to pull the images or not. The value can be one of 'Never', 'IfNotPresent' or 'Always'
ca: estableix si s'han d'estirar les imatges o no. El valor pot ser un de 'Never', 'IfNotPresent' o 'Always'
ja: イメージをプルするかどうかを設定します。値は 「Never」、 「IfNotPresent」、または 「Always」のいずれかになります

source: PTF ID
ca: ID PTF

source: Test package ID
ca: ID del paquet de prova
ja: テストパッケージID

source: SCC user
ca: Usuari SCC
ja: SCCユーザ

source: Actually remove the server
ca: Elimina el servidor
ja: 実際にサーバを削除する

source: Also remove the volumes
ca: Elimina també els volums
ja: ボリュームも削除する

source: Also remove the container images
ca: Elimina també les imatges del contenidor
ja: コンテナイメージも削除する

source: failed to parse configuration file %s
ca: no s'ha pogut analitzar el fitxer de configuració %s
ja: 設定ファイル %s の解析に失敗しました

source: Failed to find home directory
ca: No s'ha pogut trobar el directori d'inici
ja: ホームディレクトリの検索に失敗しました

source: failed to bind %[1]s config to parameter %[2]s
ca: no s'ha pogut vincular la configuració de %[1]s al paràmetre %[2]s
ja: %[1]s 設定をパラメータ %[2]s にバインドできませんでした

source: Usage:{{if .Runnable}} {{.UseLine}}{{end}}{{if .HasAvailableSubCommands}} {{.CommandPath}} [command]{{end}}{{if gt (len .Aliases) 0}} Aliases: {{.NameAndAliases}}{{end}}{{if .HasExample}} Examples: {{.Example}}{{end}}{{if .HasAvailableSubCommands}}{{$cmds := .Commands}}{{if eq (len .Groups) 0}} Available Commands:{{range $cmds}}{{if (or .IsAvailableCommand (eq .Name "help"))}} {{rpad .Name .NamePadding }} {{.Short}}{{end}}{{end}}{{else}}{{range $group := .Groups}} {{.Title}}{{range $cmds}}{{if (and (eq .GroupID $group.ID) (or .IsAvailableCommand (eq .Name "help")))}} {{rpad .Name .NamePadding }} {{.Short}}{{end}}{{end}}{{end}}{{if not .AllChildCommandsHaveGroup}} Additional Commands:{{range $cmds}}{{if (and (eq .GroupID "") (or .IsAvailableCommand (eq .Name "help")))}} {{rpad .Name .NamePadding }} {{.Short}}{{end}}{{end}}{{end}}{{end}}{{end}}{{if .HasAvailableLocalFlags}} Flags: {{.LocalFlags.FlagUsages | trimTrailingWhitespaces}}{{end}}{{if .HasAvailableInheritedFlags}} Global Flags: {{.InheritedFlags.FlagUsages | trimTrailingWhitespaces}}{{end}}{{if .HasHelpSubCommands}} Additional help topics:{{range .Commands}}{{if .IsAdditionalHelpTopicCommand}} {{rpad .CommandPath .CommandPathPadding}} {{.Short}}{{end}}{{end}}{{end}}{{if .HasAvailableSubCommands}} Use "{{.CommandPath}} [command] --help" for more information about a command.{{end}}
ca: Ús:{{if .Executable}} {{.UseLine}}{{end}}{{if .HasAvailableSubCommands}} {{.CommandPath}} [ordre]{{end}}{{if gt (len .Àlies) 0}} Àlies: {{.NameAndAliases}}{{end}}{{if .HasExample}} Exemples: {{.Exemple}}{{end}}{{if .HasAvailableSubCommands}}{{$cmds :. .Ordres}}{{if eq (len .Grups) 0}} Ordres disponibles:{{range $cmds}}{{if (o .IsAvailableCommand (eq .Nom "ajuda")}} {{rpad .Nom .NamePadding }} {{.Curt}}{{end}}{{end}}{{else}}{{range $group :. .Grups}} {{.Títol}}{{range $cmds}}{{if (i (eq .GroupID $group.ID) (o .IsAvailableCommand (eq .Nom "ajuda"))}} {{rpad .Nom .NamePadding }} {{.Curt}}{{end}}{{end}}{{end}}{{if not .AllChildCommandsHaveGroup}} Ordres addicionals:{{range $cmds}}{{if (i (eq .GroupID "") (o .IsAvailableCommand (eq .Nom "ajuda"))}} {{rpad .Nom .NamePadding }} {{.Curt}}{{end}}{{end}}{{end}}{{end}}{{end}}{{end}}{{end}}{{if .HasAvailableLocalFlags}} Banderes: {{.LocalFlags.FlagUsages . trimTrailingWhitespaces}}{{end}}{{if .HasAvailableInheritedFlags}} Banderes globals: {{.HeritedFlags.FlagUsages . trimTrailingWhitespaces}}{{end}}{{if .HasHelpSubCommands}} Temes d'ajuda addicionals:{{range .Ordres}}{{if .IsAdditionalHelpTopicCommand}} {{rpad .CommandPath .OrdrePathPadding}} {{.Curt}}{{end}}{{end}}{{end}}{{end}}{{if .HasAvailableSubCommands}} Utilitza "{{.CommandPath}} [ordre] --help" per a més informació sobre una ordre.{{end}}
ja: 使用方法:{{if .Runnable}} {{.UseLine}}{{end}}{{if .HasAvailableSubCommands}} {{.CommandPath}} [command]{{end}}{{if gt (len .Aliases) 0}} エイリアス: {{.NameAndAliases}}{{end}}{{if .HasExample}} 例: {{.Example}}{{end}}{{if .HasAvailableSubCommands}}{{$cmds := .Commands}}{{if eq (len .Groups) 0}} 利用可能なコマンド:{{range $cmds}}{{if (or .IsAvailableCommand (eq .Name "help"))}} {{rpad .Name .NamePadding }} {{.Short}}{{end}}{{end}}{{else}}{{range $group := .Groups}} {{.Title}}{{range $cmds}}{{if (and (eq .GroupID $group.ID) (or .IsAvailableCommand (eq .Name "help")))}} {{rpad .Name .NamePadding }} {{.Short}}{{end}}{{end}}{{end}}{{if not .AllChildCommandsHaveGroup}} 追加のコマンド:{{range $cmds}}{{if (and (eq .GroupID "") (or .IsAvailableCommand (eq .Name "help")))}} {{rpad .Name .NamePadding }} {{.Short}}{{end}}{{end}}{{end}}{{end}}{{end}}{{if .HasAvailableLocalFlags}} フラグ: {{.LocalFlags.FlagUsages | trimTrailingWhitespaces}}{{end}}{{if .HasAvailableInheritedFlags}} グローバルフラグ: {{.InheritedFlags.FlagUsages | trimTrailingWhitespaces}}{{end}}{{if .HasHelpSubCommands}} 追加のヘルプトピック:{{range .Commands}}{{if .IsAdditionalHelpTopicCommand}} {{rpad .CommandPath .CommandPathPadding}} {{.Short}}{{end}}{{end}}{{end}}{{if .HasAvailableSubCommands}} コマンドの詳細については、「{{.CommandPath}} [command] --help」を使用してください。{{end}}

source: Configuration: All the non-global flags can alternatively be passed as configuration. The configuration file is a YAML file with entries matching the flag name. The name of a flag is the part after the '--' of the command line parameter. Every '_' character in the flag name means a nested property. For instance the '--tz CEST' and '--ssl-password secret' will be mapped to this YAML configuration: tz: CEST ssl: password: secret The configuration file will be searched in the following places and order: · /etc/uyuni/uyuni-tools.yaml · $XDG_CONFIG_HOME/{{ .Name }}/{{ .ConfigFile }} · $HOME/.config/{{ .Name }}/{{ .ConfigFile }} · $PWD/{{ .ConfigFile }} · the value of the --config flag Environment variables: All the non-global flags can also be passed as environment variables. The environment variable name is the flag name with '-' replaced by with '_' and the {{ .EnvPrefix }} prefix. For example the '--tz CEST' flag will be mapped to '{{ .EnvPrefix }}_TZ' and '--ssl-password' flags to '{{ .EnvPrefix }}_SSL_PASSWORD'
ca: Configuració: Totes les banderes no globals es poden passar alternativament com a configuració. El fitxer de configuració és un fitxer YAML amb entrades que coincideixin amb el nom de l'indicador. El nom d'una bandera és la part després de la «--» del paràmetre de la línia d'ordres. Cada caràcter '' en el nom de la bandera significa una propietat niada. Per exemple, el '--tz CEST' i '--ssl-password secret' s'assignaran a aquesta configuració del YAML: tz: CEST ssl: contrasenya: secret El fitxer de configuració es cercarà en els següents llocs i ordre: · /etc/uyuni/uyuni-tools.yaml · $XDGCONFIGHOME/{{ .Nom }}/{{ .ConfigFile }} · $HOME/.config/{{ .Nom }}/{{ .ConfigFile }} · $PWD/{{ .ConfigFile }} · el valor de l'indicador --config Variables d'entorn: Totes les banderes no globals també es poden passar com a variables d'entorn. El nom de la variable d'entorn és el nom de la bandera amb «-» reemplaçat per «» i el {{ .Prefix d'EnvPrefix }}. Per exemple, la bandera '--tz CEST' s'assignarà a '{{ .EnvPrefix }}TZ' i els indicadors «--ssl-password» a «{{ ».EnvPrefix }}SSLPASSWORD'
ja: 設定: 非グローバルフラグはすべて設定として渡すこともできます。 設定ファイルはフラグ名と一致するエントリを含むYAMLファイルです。 フラグの名前はコマンドラインパラメータの「--」以降の部分です。 フラグ名の「_」文字はすべて、ネストされたプロパティを意味します。 たとえば 「--tz CEST」と「--ssl-password secret」はこのYAML設定にマップされます。 tz: CEST ssl: パスワード: secret 設定ファイルは以下の場所と順序で検索されます: · /etc/uyuni/uyuni-tools.yam · $XDG_CONFIG_HOME/{{ .Name }}/{{ .ConfigFile }} · $HOME/.config/{{ .Name }}/{{ .ConfigFile }} · $PWD/{{ .ConfigFile }} · the value of the --config flag 環境変数: 非グローバルフラグはすべて、環境変数として渡すこともできます。 環境変数名は、フラグ名の「-」を「_」に置き換え、{{ .EnvPrefix }}プレフィックスを付けたものです。 たとえば、「--tz CEST」フラグは「{{ .EnvPrefix }}_TZ」にマップされ、 「--ssl-password」フラグは「{{ .EnvPrefix }}_SSL_PASSWORD」にマップされます。

source: Help on configuration file and environment variables
ca: Ajuda sobre el fitxer de configuració i les variables d'entorn
ja: 設定ファイルと環境変数のヘルプ

source: failed to compute config help command
ca: no s'ha pogut calcular l'ordre d'ajuda de configuració
ja: config helpコマンドの計算に失敗しました

source: cannot check content of %s
ca: no es pot comprovar el contingut de %s
ja: %s の内容を確認できません

source: Cannot remove %s folder
ca: No es pot eliminar la carpeta %s
ja: %s フォルダを削除できません

source: Failed to get %s file informations
ca: No s'ha pogut obtenir la informació del fitxer %s
ja: %s ファイル情報の取得に失敗しました

source: Failed to read file %s
ca: No s'ha pogut llegir el fitxer %s
ja: ファイル %s の読み込みに失敗しました

source: Would remove file %s
ca: Eliminaria el fitxer %s
ja: ファイル %s を削除します

source: Removing file %s
ca: S'està suprimint el fitxer %s
ja: ファイル %s を削除中

source: Failed to remove file %s
ca: No s'ha pogut eliminar el fitxer %s
ja: ファイル %s の削除に失敗しました

source: failed to create temporary directory
ca: no s'ha pogut crear el directori temporal
ja: 一時ディレクトリの作成に失敗しました

source: failed to remove temporary directory
ca: no s'ha pogut eliminar el directori temporal
ja: 一時ディレクトリの削除に失敗しました

source: fails to open %s file
ca: no s'ha pogut obrir el fitxer %s
ja: %s ファイルを開けません

source: failed to read %s file
ca: no s'ha pogut llegir el fitxer %s
ja: %s ファイルの読み込みに失敗しました

source: failed to copy %s file
ca: no s'ha pogut copiar el fitxer %s
ja: %s ファイルのコピーに失敗しました

source: Flags:
ca: Banderes:
ja: フラグ:

source: no such flag help group: %v
ca: no existeix el grup d'ajuda de l'indicador: %v
ja: そのようなフラグヘルプグループはありません: %v

source: cannot read config
ca: no es pot llegir la configuració
ja: 設定を読み込めません

source: failed to unmarshal the inspected data
ca: no s'han pogut desmarcar les dades inspeccionades
ja: 検査データのアンマーシャルに失敗しました

source: Couldn't open %[1]s file for writing, writing log to %[2]s
ca: No s'ha pogut obrir el fitxer %[1]s per a escriptura, s'està escrivint el registre a %[2]s
ja: %[1]s ファイルを書き込み用に開けませんでした。ログを %[2]s に書き込みます

source: Unable to detect hostname, using localhost
ca: No s'ha pogut detectar el nom de l'ordinador, s'està utilitzant el localhost
ja: ホスト名を検出できません。localhostを使用しています

source: Preparing the tarball
ca: Preparant el tarball
ja: tarballの準備中

source: failed to add %s to tarball
ca: no s'ha pogut afegir %s a tarball
ja: %s をtarballに追加できませんでした

source: failed to run supportconfig on the host
ca: no s'ha pogut executar supportconfig a l'amfitrió
ja: ホスト上でsupportconfigを実行できませんでした

source: failed to find host supportconfig tarball from command output
ca: no s'ha pogut trobar l'amfitrió supportconfig tarball des de la sortida de l'ordre
ja: コマンド出力からホストのsupportconfig tarballが見つかりませんでした

source: supportconfig is not available on the host, skipping it
ca: supportconfig no està disponible al servidor, s'ometrà
ja: supportconfigはホストで利用できないため、スキップします

source: Skipping extraction of %[1]s in %[2]s file as it resolves outside the target path
ca: S'està ometent l'extracció de %[1]s al fitxer %[2]s mentre es resol fora del camí de destinació
ja: ターゲットパスの外部で解決されるため、%[1]s ( %[2]s ファイル内)の抽出をスキップします

source: failed to write tar.gz to %s
ca: no s'ha pogut escriure tar.gz a %s
ja: tar.gzの %s への書き込みに失敗しました

source: %s file already present, not overwriting
ca: El fitxer %s ja està present, no se sobreescriu
ja: %s ファイルはすでに存在します。上書きされません

source: failed to open %s for writing
ca: no s'ha pogut obrir %s per a escriptura
ja: 書き込みのために %s を開けませんでした

source: Has to be more than %d character long
ca: Ha de tenir més d'%d caràcter
ja: %d 文字以上の長さである必要があります

source: Has to be less than %d character long
ca: Ha de tenir menys d'%d caràcter
ja: %d 文字未満である必要があります

source: Failed to read password
ca: No s'ha pogut llegir la contrasenya
ja: パスワードの読み込みに失敗しました

source: Cannot contain spaces or tabs
ca: No es poden contenir espais o pestanyes
ja: スペースやタブを含むことはできません

source: not an interactive device, not asking for missing value
ca: no és un dispositiu interactiu, no es demana el valor que manca
ja: 対話型デバイスではないので、不足している値を求めません

source: Confirm the password
ca: Confirmeu la contrasenya
ja: パスワードの確認

source: Two different passwords have been provided
ca: S'han proporcionat dues contrasenyes diferents
ja: 2つの異なるパスワードが指定されています

source: failed to read input
ca: no s'ha pogut llegir l'entrada
ja: 入力の読み込みに失敗しました

source: A value is required
ca: Es requereix un valor
ja: 値が必要がです

source: Registry %[1]s would be used instead of namespace %[2]s
ca: El registre %[1]s s'utilitzaria en lloc de l'espai de noms %[2]s
ja: ネームスペース %[2]s のかわりにレジストリ %[1]s が使用されます

source: invalid image name: %s
ca: el nom de la imatge no és vàlid: %s
ja: 無効なイメージ名: %s

source: tag missing on %s
ca: falta l'etiqueta a %s
ja: タグが %s で見つかりません

source: Computed image name is %s
ca: El nom de la imatge calculada és %s
ja: 計算されたイメージ名は %s です

source: Failed to run %s
ca: No s'ha pogut executar %s
ja: %s の実行に失敗しました

source: Failed to read random data
ca: No s'han pogut llegir les dades aleatòries
ja: ランダムデータの読み込みに失敗しました
