Repository: uyuni-project/uyuni-tools
Catalog: locale/shared/*.po
Languages: ca, ja

source: error downloading from %s
ca: s'ha produït un error en baixar de %s
ja: %s からのダウンロードでエラーが発生しました

source: bad status: %s
ca: estat incorrecte: %s
ja: 不良ステータス: %s

source: failed to compute server FQDN
ca: no s'ha pogut calcular el servidor FQDN
ja: サーバFQDNの計算に失敗しました

source: %s is not a valid FQDN
ca: %s no és un FQDN vàlid
ja: %s は有効なFQDNではありません

source: cannot resolve %s
ca: no es pot resoldre %s
ja: %s を解決できません

source: error creating file %s
ca: s'ha produït un error en crear el fitxer %s
ja: ファイル %s の作成中にエラーが発生しました

source: error writing file %s
ca: s'ha produït un error en escriure el fitxer %s
ja: ファイル %s の書き込み中にエラーが発生しました

source: Failed to calculate checksum of the file %s
ca: No s'ha pogut calcular la suma de verificació del fitxer %s
ja: ファイル %s のチェックサムの計算に失敗しました

source: Failed to write checksum of the file %[1]s to the %[2]s
ca: No s'ha pogut escriure la suma de verificació del fitxer %[1]s a %[2]s
ja: ファイル %[1]s のチェックサムを %[2]s に書き込めませんでした

source: Checksum of %s does not match
ca: La suma de verificació de %s no coincideix
ja: %s のチェックサムが一致しません

source: Main service
ca: Servei principal
ja: 主なサービス

source: Migration helper
ca: Assistent de migració
ja: 移行ヘルパー

source: Confidential computing attestation
ca: Certificació d'informàtica confidencial
ja: コンフィデンシャルコンピューティング認証

source: Hub XML-RPC API
ca: API del concentrador XML-RPC

source: Database
ca: Base de dades
ja: データベース

source: no UYUNI_IMAGE defined in %s systemd service
ja: %s systemdサービスにUYUNI_IMAGEが定義されていません

source: failed to login to registry.suse.com
ja: registry.suse.comへのログインに失敗しました

source: failed to generate inspect script
ja: 検査スクリプトの生成に失敗しました

source: cannot read file %s
ja: ファイル %s を読み込めません
